**free
// This contains global constants, variables and prototypes
// for the Payroll Maintainance app

 //
 //   Compile time array containing error descriptions.
Dcl-S ERR             Char(50)        DIM(10) CTDATA PERRCD(1);

Dcl-C INVALID_MAINTENANCE_SELECTION 1;
Dcl-C INVALID_ACTION_CODE 4;

