**FREE

Dcl-PR printf_jl Int(10) extproc('Qp0zLprintf');
  format Pointer value options(*string);
End-PR;

Dcl-PR printf Int(10) extproc('printf');
  format Pointer value options(*string);
End-PR;

Dcl-PR QzshSystem Int(10) extproc('QzshSystem');
  format Pointer value options(*string);
End-PR;

Dcl-PR system Int(10) extproc('system');
  *N Pointer    value options(*string);
End-PR;

Dcl-PR QCmdExc  extpgm('QCMDEXC');
  *N             Char(1024)  options(*varsize) const;
  *N             Packed(15:5) const;
End-PR;

dcl-pr getenv pointer extproc('getenv');
  *n pointer value options(*string:*trim);
end-pr;