**FREE

Dcl-Pr Utils_Lower Char(10) ExtProc;
  *N Char(10) Value;
End-Pr;

Dcl-Pr Utils_Print ExtProc;
  Command VARCHAR(512) CONST;
End-Pr;

Dcl-Pr Utils_Qsh IND ExtProc;
  Command VARCHAR(512) CONST;
End-Pr;

Dcl-Pr Utils_JobType Char(1) ExtProc;
End-Pr;